RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18.h
#define USBHS_USBINTR_UE(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBINTR_UE_SHIFT))&USBHS_USBINTR_UE_MASK)
#define USBHS_USBINTR_UEE_MASK                   0x2u
#define USBHS_USBINTR_UEE_SHIFT                  1
#define USBHS_USBINTR_UEE_WIDTH                  1
#define USBHS_USBINTR_UEE(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_USBINTR_UEE_SHIFT))&USBHS_USBINTR_UEE_MASK)
#define USBHS_USBINTR_PCE_MASK                   0x4u
#define USBHS_USBINTR_PCE_SHIFT                  2
#define USBHS_USBINTR_PCE_WIDTH                  1
#define USBHS_USBINTR_PCE(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_USBINTR_PCE_SHIFT))&USBHS_USBINTR_PCE_MASK)
#define USBHS_USBINTR_FRE_MASK                   0x8u
#define USBHS_USBINTR_FRE_SHIFT                  3
#define USBHS_USBINTR_FRE_WIDTH                  1
#define USBHS_USBINTR_FRE(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_USBINTR_FRE_SHIFT))&USBHS_USBINTR_FRE_MASK)
#define USBHS_USBINTR_SEE_MASK                   0x10u
#define USBHS_USBINTR_SEE_SHIFT                  4
#define USBHS_USBINTR_SEE_WIDTH                  1
#define USBHS_USBINTR_SEE(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_USBINTR_SEE_SHIFT))&USBHS_USBINTR_SEE_MASK)
#define USBHS_USBINTR_AAE_MASK                   0x20u
#define USBHS_USBINTR_AAE_SHIFT                  5
#define USBHS_USBINTR_AAE_WIDTH                  1
#define USBHS_USBINTR_AAE(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_USBINTR_AAE_SHIFT))&USBHS_USBINTR_AAE_MASK)
#define USBHS_USBINTR_URE_MASK                   0x40u
#define USBHS_USBINTR_URE_SHIFT                  6
#define USBHS_USBINTR_URE_WIDTH                  1
#define USBHS_USBINTR_URE(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_USBINTR_URE_SHIFT))&USBHS_USBINTR_URE_MASK)
#define USBHS_USBINTR_SRE_MASK                   0x80u
#define USBHS_USBINTR_SRE_SHIFT                  7
#define USBHS_USBINTR_SRE_WIDTH                  1
#define USBHS_USBINTR_SRE(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_USBINTR_SRE_SHIFT))&USBHS_USBINTR_SRE_MASK)
#define USBHS_USBINTR_SLE_MASK                   0x100u
#define USBHS_USBINTR_SLE_SHIFT                  8
#define USBHS_USBINTR_SLE_WIDTH                  1
#define USBHS_USBINTR_SLE(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_USBINTR_SLE_SHIFT))&USBHS_USBINTR_SLE_MASK)
#define USBHS_USBINTR_NAKE_MASK                  0x10000u
#define USBHS_USBINTR_NAKE_SHIFT                 16
#define USBHS_USBINTR_NAKE_WIDTH                 1
#define USBHS_USBINTR_NAKE(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_USBINTR_NAKE_SHIFT))&USBHS_USBINTR_NAKE_MASK)
#define USBHS_USBINTR_UAIE_MASK                  0x40000u
#define USBHS_USBINTR_UAIE_SHIFT                 18
#define USBHS_USBINTR_UAIE_WIDTH                 1
#define USBHS_USBINTR_UAIE(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_USBINTR_UAIE_SHIFT))&USBHS_USBINTR_UAIE_MASK)
#define USBHS_USBINTR_UPIE_MASK                  0x80000u
#define USBHS_USBINTR_UPIE_SHIFT                 19
#define USBHS_USBINTR_UPIE_WIDTH                 1
#define USBHS_USBINTR_UPIE(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_USBINTR_UPIE_SHIFT))&USBHS_USBINTR_UPIE_MASK)
#define USBHS_USBINTR_TIE0_MASK                  0x1000000u
#define USBHS_USBINTR_TIE0_SHIFT                 24
#define USBHS_USBINTR_TIE0_WIDTH                 1
#define USBHS_USBINTR_TIE0(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_USBINTR_TIE0_SHIFT))&USBHS_USBINTR_TIE0_MASK)
#define USBHS_USBINTR_TIE1_MASK                  0x2000000u
#define USBHS_USBINTR_TIE1_SHIFT                 25
#define USBHS_USBINTR_TIE1_WIDTH                 1
#define USBHS_USBINTR_TIE1(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_USBINTR_TIE1_SHIFT))&USBHS_USBINTR_TIE1_MASK)
/* FRINDEX Bit Fields */
#define USBHS_FRINDEX_FRINDEX_MASK               0x3FFFu
#define USBHS_FRINDEX_FRINDEX_SHIFT              0
#define USBHS_FRINDEX_FRINDEX_WIDTH              14
#define USBHS_FRINDEX_FRINDEX(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_FRINDEX_FRINDEX_SHIFT))&USBHS_FRINDEX_FRINDEX_MASK)
#define USBHS_FRINDEX_Reerved_MASK               0xFFFFC000u
#define USBHS_FRINDEX_Reerved_SHIFT              14
#define USBHS_FRINDEX_Reerved_WIDTH              18
#define USBHS_FRINDEX_Reerved(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_FRINDEX_Reerved_SHIFT))&USBHS_FRINDEX_Reerved_MASK)
/* DEVICEADDR Bit Fields */
#define USBHS_DEVICEADDR_USBADRA_MASK            0x1000000u
#define USBHS_DEVICEADDR_USBADRA_SHIFT           24
#define USBHS_DEVICEADDR_USBADRA_WIDTH           1
#define USBHS_DEVICEADDR_USBADRA(x)              (((uint32_t)(((uint32_t)(x))<<USBHS_DEVICEADDR_USBADRA_SHIFT))&USBHS_DEVICEADDR_USBADRA_MASK)
#define USBHS_DEVICEADDR_USBADR_MASK             0xFE000000u
#define USBHS_DEVICEADDR_USBADR_SHIFT            25
#define USBHS_DEVICEADDR_USBADR_WIDTH            7
#define USBHS_DEVICEADDR_USBADR(x)               (((uint32_t)(((uint32_t)(x))<<USBHS_DEVICEADDR_USBADR_SHIFT))&USBHS_DEVICEADDR_USBADR_MASK)
/* PERIODICLISTBASE Bit Fields */
#define USBHS_PERIODICLISTBASE_PERBASE_MASK      0xFFFFF000u
#define USBHS_PERIODICLISTBASE_PERBASE_SHIFT     12
#define USBHS_PERIODICLISTBASE_PERBASE_WIDTH     20
#define USBHS_PERIODICLISTBASE_PERBASE(x)        (((uint32_t)(((uint32_t)(x))<<USBHS_PERIODICLISTBASE_PERBASE_SHIFT))&USBHS_PERIODICLISTBASE_PERBASE_MASK)
/* ASYNCLISTADDR Bit Fields */
#define USBHS_ASYNCLISTADDR_ASYBASE_MASK         0xFFFFFFE0u
#define USBHS_ASYNCLISTADDR_ASYBASE_SHIFT        5
#define USBHS_ASYNCLISTADDR_ASYBASE_WIDTH        27
#define USBHS_ASYNCLISTADDR_ASYBASE(x)           (((uint32_t)(((uint32_t)(x))<<USBHS_ASYNCLISTADDR_ASYBASE_SHIFT))&USBHS_ASYNCLISTADDR_ASYBASE_MASK)
/* EPLISTADDR Bit Fields */
#define USBHS_EPLISTADDR_EPBASE_MASK             0xFFFFF800u
#define USBHS_EPLISTADDR_EPBASE_SHIFT            11
#define USBHS_EPLISTADDR_EPBASE_WIDTH            21
#define USBHS_EPLISTADDR_EPBASE(x)               (((uint32_t)(((uint32_t)(x))<<USBHS_EPLISTADDR_EPBASE_SHIFT))&USBHS_EPLISTADDR_EPBASE_MASK)
/* TTCTRL Bit Fields */
#define USBHS_TTCTRL_TTHA_MASK                   0x7F000000u
#define USBHS_TTCTRL_TTHA_SHIFT                  24
#define USBHS_TTCTRL_TTHA_WIDTH                  7
#define USBHS_TTCTRL_TTHA(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_TTCTRL_TTHA_SHIFT))&USBHS_TTCTRL_TTHA_MASK)
#define USBHS_TTCTRL_Reerved_MASK                0x80000000u
#define USBHS_TTCTRL_Reerved_SHIFT               31
#define USBHS_TTCTRL_Reerved_WIDTH               1
#define USBHS_TTCTRL_Reerved(x)                  (((uint32_t)(((uint32_t)(x))<<USBHS_TTCTRL_Reerved_SHIFT))&USBHS_TTCTRL_Reerved_MASK)
/* BURSTSIZE Bit Fields */
#define USBHS_BURSTSIZE_RXPBURST_MASK            0xFFu
#define USBHS_BURSTSIZE_RXPBURST_SHIFT           0
#define USBHS_BURSTSIZE_RXPBURST_WIDTH           8
#define USBHS_BURSTSIZE_RXPBURST(x)              (((uint32_t)(((uint32_t)(x))<<USBHS_BURSTSIZE_RXPBURST_SHIFT))&USBHS_BURSTSIZE_RXPBURST_MASK)
#define USBHS_BURSTSIZE_TXPBURST_MASK            0xFF00u
#define USBHS_BURSTSIZE_TXPBURST_SHIFT           8
#define USBHS_BURSTSIZE_TXPBURST_WIDTH           8
#define USBHS_BURSTSIZE_TXPBURST(x)              (((uint32_t)(((uint32_t)(x))<<USBHS_BURSTSIZE_TXPBURST_SHIFT))&USBHS_BURSTSIZE_TXPBURST_MASK)
/* TXFILLTUNING Bit Fields */
#define USBHS_TXFILLTUNING_TXSCHOH_MASK          0x7Fu
#define USBHS_TXFILLTUNING_TXSCHOH_SHIFT         0
#define USBHS_TXFILLTUNING_TXSCHOH_WIDTH         7
#define USBHS_TXFILLTUNING_TXSCHOH(x)            (((uint32_t)(((uint32_t)(x))<<USBHS_TXFILLTUNING_TXSCHOH_SHIFT))&USBHS_TXFILLTUNING_TXSCHOH_MASK)
#define USBHS_TXFILLTUNING_TXSCHHEALTH_MASK      0x1F00u
#define USBHS_TXFILLTUNING_TXSCHHEALTH_SHIFT     8
#define USBHS_TXFILLTUNING_TXSCHHEALTH_WIDTH     5
#define USBHS_TXFILLTUNING_TXSCHHEALTH(x)        (((uint32_t)(((uint32_t)(x))<<USBHS_TXFILLTUNING_TXSCHHEALTH_SHIFT))&USBHS_TXFILLTUNING_TXSCHHEALTH_MASK)
#define USBHS_TXFILLTUNING_TXFIFOTHRES_MASK      0x3F0000u
#define USBHS_TXFILLTUNING_TXFIFOTHRES_SHIFT     16
#define USBHS_TXFILLTUNING_TXFIFOTHRES_WIDTH     6
#define USBHS_TXFILLTUNING_TXFIFOTHRES(x)        (((uint32_t)(((uint32_t)(x))<<USBHS_TXFILLTUNING_TXFIFOTHRES_SHIFT))&USBHS_TXFILLTUNING_TXFIFOTHRES_MASK)
/* ENDPTNAK Bit Fields */
#define USBHS_ENDPTNAK_EPRN_MASK                 0xFu
#define USBHS_ENDPTNAK_EPRN_SHIFT                0
#define USBHS_ENDPTNAK_EPRN_WIDTH                4
#define USBHS_ENDPTNAK_EPRN(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_ENDPTNAK_EPRN_SHIFT))&USBHS_ENDPTNAK_EPRN_MASK)
#define USBHS_ENDPTNAK_EPTN_MASK                 0xF0000u
#define USBHS_ENDPTNAK_EPTN_SHIFT                16
#define USBHS_ENDPTNAK_EPTN_WIDTH                4
#define USBHS_ENDPTNAK_EPTN(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_ENDPTNAK_EPTN_SHIFT))&USBHS_ENDPTNAK_EPTN_MASK)
/* ENDPTNAKEN Bit Fields */
#define USBHS_ENDPTNAKEN_EPRNE_MASK              0xFu
#define USBHS_ENDPTNAKEN_EPRNE_SHIFT             0
#define USBHS_ENDPTNAKEN_EPRNE_WIDTH             4
#define USBHS_ENDPTNAKEN_EPRNE(x)                (((uint32_t)(((uint32_t)(x))<<USBHS_ENDPTNAKEN_EPRNE_SHIFT))&USBHS_ENDPTNAKEN_EPRNE_MASK)
#define USBHS_ENDPTNAKEN_EPTNE_MASK              0xF0000u
#define USBHS_ENDPTNAKEN_EPTNE_SHIFT             16
#define USBHS_ENDPTNAKEN_EPTNE_WIDTH             4
#define USBHS_ENDPTNAKEN_EPTNE(x)                (((uint32_t)(((uint32_t)(x))<<USBHS_ENDPTNAKEN_EPTNE_SHIFT))&USBHS_ENDPTNAKEN_EPTNE_MASK)
/* PORTSC1 Bit Fields */
#define USBHS_PORTSC1_CCS_MASK                   0x1u
#define USBHS_PORTSC1_CCS_SHIFT                  0
#define USBHS_PORTSC1_CCS_WIDTH                  1
#define USBHS_PORTSC1_CCS(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_CCS_SHIFT))&USBHS_PORTSC1_CCS_MASK)
#define USBHS_PORTSC1_CSC_MASK                   0x2u
#define USBHS_PORTSC1_CSC_SHIFT                  1
#define USBHS_PORTSC1_CSC_WIDTH                  1
#define USBHS_PORTSC1_CSC(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_CSC_SHIFT))&USBHS_PORTSC1_CSC_MASK)
#define USBHS_PORTSC1_PE_MASK                    0x4u
#define USBHS_PORTSC1_PE_SHIFT                   2
#define USBHS_PORTSC1_PE_WIDTH                   1
#define USBHS_PORTSC1_PE(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PE_SHIFT))&USBHS_PORTSC1_PE_MASK)
#define USBHS_PORTSC1_PEC_MASK                   0x8u
#define USBHS_PORTSC1_PEC_SHIFT                  3
#define USBHS_PORTSC1_PEC_WIDTH                  1
#define USBHS_PORTSC1_PEC(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PEC_SHIFT))&USBHS_PORTSC1_PEC_MASK)
#define USBHS_PORTSC1_OCA_MASK                   0x10u
#define USBHS_PORTSC1_OCA_SHIFT                  4
#define USBHS_PORTSC1_OCA_WIDTH                  1
#define USBHS_PORTSC1_OCA(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_OCA_SHIFT))&USBHS_PORTSC1_OCA_MASK)
#define USBHS_PORTSC1_OCC_MASK                   0x20u
#define USBHS_PORTSC1_OCC_SHIFT                  5
#define USBHS_PORTSC1_OCC_WIDTH                  1
#define USBHS_PORTSC1_OCC(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_OCC_SHIFT))&USBHS_PORTSC1_OCC_MASK)
#define USBHS_PORTSC1_FPR_MASK                   0x40u
#define USBHS_PORTSC1_FPR_SHIFT                  6
#define USBHS_PORTSC1_FPR_WIDTH                  1
#define USBHS_PORTSC1_FPR(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_FPR_SHIFT))&USBHS_PORTSC1_FPR_MASK)
#define USBHS_PORTSC1_SUSP_MASK                  0x80u
#define USBHS_PORTSC1_SUSP_SHIFT                 7
#define USBHS_PORTSC1_SUSP_WIDTH                 1
#define USBHS_PORTSC1_SUSP(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_SUSP_SHIFT))&USBHS_PORTSC1_SUSP_MASK)
#define USBHS_PORTSC1_PR_MASK                    0x100u
#define USBHS_PORTSC1_PR_SHIFT                   8
#define USBHS_PORTSC1_PR_WIDTH                   1
#define USBHS_PORTSC1_PR(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PR_SHIFT))&USBHS_PORTSC1_PR_MASK)
#define USBHS_PORTSC1_HSP_MASK                   0x200u
#define USBHS_PORTSC1_HSP_SHIFT                  9
#define USBHS_PORTSC1_HSP_WIDTH                  1
#define USBHS_PORTSC1_HSP(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_HSP_SHIFT))&USBHS_PORTSC1_HSP_MASK)
#define USBHS_PORTSC1_LS_MASK                    0xC00u
#define USBHS_PORTSC1_LS_SHIFT                   10
#define USBHS_PORTSC1_LS_WIDTH                   2
#define USBHS_PORTSC1_LS(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_LS_SHIFT))&USBHS_PORTSC1_LS_MASK)
#define USBHS_PORTSC1_PP_MASK                    0x1000u
#define USBHS_PORTSC1_PP_SHIFT                   12
#define USBHS_PORTSC1_PP_WIDTH                   1
#define USBHS_PORTSC1_PP(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PP_SHIFT))&USBHS_PORTSC1_PP_MASK)
#define USBHS_PORTSC1_PO_MASK                    0x2000u
#define USBHS_PORTSC1_PO_SHIFT                   13
#define USBHS_PORTSC1_PO_WIDTH                   1
#define USBHS_PORTSC1_PO(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PO_SHIFT))&USBHS_PORTSC1_PO_MASK)
#define USBHS_PORTSC1_PIC_MASK                   0xC000u
#define USBHS_PORTSC1_PIC_SHIFT                  14
#define USBHS_PORTSC1_PIC_WIDTH                  2
#define USBHS_PORTSC1_PIC(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PIC_SHIFT))&USBHS_PORTSC1_PIC_MASK)
#define USBHS_PORTSC1_PTC_MASK                   0xF0000u
#define USBHS_PORTSC1_PTC_SHIFT                  16
#define USBHS_PORTSC1_PTC_WIDTH                  4
#define USBHS_PORTSC1_PTC(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PTC_SHIFT))&USBHS_PORTSC1_PTC_MASK)
#define USBHS_PORTSC1_WKCN_MASK                  0x100000u
#define USBHS_PORTSC1_WKCN_SHIFT                 20
#define USBHS_PORTSC1_WKCN_WIDTH                 1
#define USBHS_PORTSC1_WKCN(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_WKCN_SHIFT))&USBHS_PORTSC1_WKCN_MASK)
#define USBHS_PORTSC1_WKDS_MASK                  0x200000u
#define USBHS_PORTSC1_WKDS_SHIFT                 21
#define USBHS_PORTSC1_WKDS_WIDTH                 1
#define USBHS_PORTSC1_WKDS(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_WKDS_SHIFT))&USBHS_PORTSC1_WKDS_MASK)
#define USBHS_PORTSC1_WKOC_MASK                  0x400000u
#define USBHS_PORTSC1_WKOC_SHIFT                 22
#define USBHS_PORTSC1_WKOC_WIDTH                 1
#define USBHS_PORTSC1_WKOC(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_WKOC_SHIFT))&USBHS_PORTSC1_WKOC_MASK)
#define USBHS_PORTSC1_PHCD_MASK                  0x800000u
#define USBHS_PORTSC1_PHCD_SHIFT                 23
#define USBHS_PORTSC1_PHCD_WIDTH                 1
#define USBHS_PORTSC1_PHCD(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PHCD_SHIFT))&USBHS_PORTSC1_PHCD_MASK)
#define USBHS_PORTSC1_PFSC_MASK                  0x1000000u
#define USBHS_PORTSC1_PFSC_SHIFT                 24
#define USBHS_PORTSC1_PFSC_WIDTH                 1
#define USBHS_PORTSC1_PFSC(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PFSC_SHIFT))&USBHS_PORTSC1_PFSC_MASK)
#define USBHS_PORTSC1_PTS2_MASK                  0x2000000u
#define USBHS_PORTSC1_PTS2_SHIFT                 25
#define USBHS_PORTSC1_PTS2_WIDTH                 1
#define USBHS_PORTSC1_PTS2(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PTS2_SHIFT))&USBHS_PORTSC1_PTS2_MASK)
#define USBHS_PORTSC1_PSPD_MASK                  0xC000000u
#define USBHS_PORTSC1_PSPD_SHIFT                 26
#define USBHS_PORTSC1_PSPD_WIDTH                 2
#define USBHS_PORTSC1_PSPD(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PSPD_SHIFT))&USBHS_PORTSC1_PSPD_MASK)
#define USBHS_PORTSC1_PTS_MASK                   0xC0000000u
#define USBHS_PORTSC1_PTS_SHIFT                  30
#define USBHS_PORTSC1_PTS_WIDTH                  2
#define USBHS_PORTSC1_PTS(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_PORTSC1_PTS_SHIFT))&USBHS_PORTSC1_PTS_MASK)
/* OTGSC Bit Fields */
#define USBHS_OTGSC_VD_MASK                      0x1u
#define USBHS_OTGSC_VD_SHIFT                     0
#define USBHS_OTGSC_VD_WIDTH                     1
#define USBHS_OTGSC_VD(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_VD_SHIFT))&USBHS_OTGSC_VD_MASK)
#define USBHS_OTGSC_VC_MASK                      0x2u
#define USBHS_OTGSC_VC_SHIFT                     1
#define USBHS_OTGSC_VC_WIDTH                     1
#define USBHS_OTGSC_VC(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_VC_SHIFT))&USBHS_OTGSC_VC_MASK)
#define USBHS_OTGSC_HAAR_MASK                    0x4u
#define USBHS_OTGSC_HAAR_SHIFT                   2
#define USBHS_OTGSC_HAAR_WIDTH                   1
#define USBHS_OTGSC_HAAR(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_HAAR_SHIFT))&USBHS_OTGSC_HAAR_MASK)
#define USBHS_OTGSC_OT_MASK                      0x8u
#define USBHS_OTGSC_OT_SHIFT                     3
#define USBHS_OTGSC_OT_WIDTH                     1
#define USBHS_OTGSC_OT(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_OT_SHIFT))&USBHS_OTGSC_OT_MASK)
#define USBHS_OTGSC_DP_MASK                      0x10u
#define USBHS_OTGSC_DP_SHIFT                     4
#define USBHS_OTGSC_DP_WIDTH                     1
#define USBHS_OTGSC_DP(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_DP_SHIFT))&USBHS_OTGSC_DP_MASK)
#define USBHS_OTGSC_IDPU_MASK                    0x20u
#define USBHS_OTGSC_IDPU_SHIFT                   5
#define USBHS_OTGSC_IDPU_WIDTH                   1
#define USBHS_OTGSC_IDPU(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_IDPU_SHIFT))&USBHS_OTGSC_IDPU_MASK)
#define USBHS_OTGSC_HABA_MASK                    0x80u
#define USBHS_OTGSC_HABA_SHIFT                   7
#define USBHS_OTGSC_HABA_WIDTH                   1
#define USBHS_OTGSC_HABA(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_HABA_SHIFT))&USBHS_OTGSC_HABA_MASK)
#define USBHS_OTGSC_ID_MASK                      0x100u
#define USBHS_OTGSC_ID_SHIFT                     8
#define USBHS_OTGSC_ID_WIDTH                     1
#define USBHS_OTGSC_ID(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_ID_SHIFT))&USBHS_OTGSC_ID_MASK)
#define USBHS_OTGSC_AVV_MASK                     0x200u
#define USBHS_OTGSC_AVV_SHIFT                    9
#define USBHS_OTGSC_AVV_WIDTH                    1
#define USBHS_OTGSC_AVV(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_AVV_SHIFT))&USBHS_OTGSC_AVV_MASK)
#define USBHS_OTGSC_ASV_MASK                     0x400u
#define USBHS_OTGSC_ASV_SHIFT                    10
#define USBHS_OTGSC_ASV_WIDTH                    1
#define USBHS_OTGSC_ASV(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_ASV_SHIFT))&USBHS_OTGSC_ASV_MASK)
#define USBHS_OTGSC_BSV_MASK                     0x800u
#define USBHS_OTGSC_BSV_SHIFT                    11
#define USBHS_OTGSC_BSV_WIDTH                    1
#define USBHS_OTGSC_BSV(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_BSV_SHIFT))&USBHS_OTGSC_BSV_MASK)
#define USBHS_OTGSC_BSE_MASK                     0x1000u
#define USBHS_OTGSC_BSE_SHIFT                    12
#define USBHS_OTGSC_BSE_WIDTH                    1
#define USBHS_OTGSC_BSE(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_BSE_SHIFT))&USBHS_OTGSC_BSE_MASK)
#define USBHS_OTGSC_MST_MASK                     0x2000u
#define USBHS_OTGSC_MST_SHIFT                    13
#define USBHS_OTGSC_MST_WIDTH                    1
#define USBHS_OTGSC_MST(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_MST_SHIFT))&USBHS_OTGSC_MST_MASK)
#define USBHS_OTGSC_DPS_MASK                     0x4000u
#define USBHS_OTGSC_DPS_SHIFT                    14
#define USBHS_OTGSC_DPS_WIDTH                    1
#define USBHS_OTGSC_DPS(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_DPS_SHIFT))&USBHS_OTGSC_DPS_MASK)
#define USBHS_OTGSC_IDIS_MASK                    0x10000u
#define USBHS_OTGSC_IDIS_SHIFT                   16
#define USBHS_OTGSC_IDIS_WIDTH                   1
#define USBHS_OTGSC_IDIS(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_IDIS_SHIFT))&USBHS_OTGSC_IDIS_MASK)
#define USBHS_OTGSC_AVVIS_MASK                   0x20000u
#define USBHS_OTGSC_AVVIS_SHIFT                  17
#define USBHS_OTGSC_AVVIS_WIDTH                  1
#define USBHS_OTGSC_AVVIS(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_AVVIS_SHIFT))&USBHS_OTGSC_AVVIS_MASK)
#define USBHS_OTGSC_ASVIS_MASK                   0x40000u
#define USBHS_OTGSC_ASVIS_SHIFT                  18
#define USBHS_OTGSC_ASVIS_WIDTH                  1
#define USBHS_OTGSC_ASVIS(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_ASVIS_SHIFT))&USBHS_OTGSC_ASVIS_MASK)
#define USBHS_OTGSC_BSVIS_MASK                   0x80000u
#define USBHS_OTGSC_BSVIS_SHIFT                  19
#define USBHS_OTGSC_BSVIS_WIDTH                  1
#define USBHS_OTGSC_BSVIS(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_BSVIS_SHIFT))&USBHS_OTGSC_BSVIS_MASK)
#define USBHS_OTGSC_BSEIS_MASK                   0x100000u
#define USBHS_OTGSC_BSEIS_SHIFT                  20
#define USBHS_OTGSC_BSEIS_WIDTH                  1
#define USBHS_OTGSC_BSEIS(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_BSEIS_SHIFT))&USBHS_OTGSC_BSEIS_MASK)
#define USBHS_OTGSC_MSS_MASK                     0x200000u
#define USBHS_OTGSC_MSS_SHIFT                    21
#define USBHS_OTGSC_MSS_WIDTH                    1
#define USBHS_OTGSC_MSS(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_MSS_SHIFT))&USBHS_OTGSC_MSS_MASK)
#define USBHS_OTGSC_DPIS_MASK                    0x400000u
#define USBHS_OTGSC_DPIS_SHIFT                   22
#define USBHS_OTGSC_DPIS_WIDTH                   1
#define USBHS_OTGSC_DPIS(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_DPIS_SHIFT))&USBHS_OTGSC_DPIS_MASK)
#define USBHS_OTGSC_IDIE_MASK                    0x1000000u
#define USBHS_OTGSC_IDIE_SHIFT                   24
#define USBHS_OTGSC_IDIE_WIDTH                   1
#define USBHS_OTGSC_IDIE(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_IDIE_SHIFT))&USBHS_OTGSC_IDIE_MASK)
#define USBHS_OTGSC_AVVIE_MASK                   0x2000000u
#define USBHS_OTGSC_AVVIE_SHIFT                  25
#define USBHS_OTGSC_AVVIE_WIDTH                  1
#define USBHS_OTGSC_AVVIE(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_AVVIE_SHIFT))&USBHS_OTGSC_AVVIE_MASK)
#define USBHS_OTGSC_ASVIE_MASK                   0x4000000u
#define USBHS_OTGSC_ASVIE_SHIFT                  26
#define USBHS_OTGSC_ASVIE_WIDTH                  1
#define USBHS_OTGSC_ASVIE(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_ASVIE_SHIFT))&USBHS_OTGSC_ASVIE_MASK)
#define USBHS_OTGSC_BSVIE_MASK                   0x8000000u
#define USBHS_OTGSC_BSVIE_SHIFT                  27
#define USBHS_OTGSC_BSVIE_WIDTH                  1
#define USBHS_OTGSC_BSVIE(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_BSVIE_SHIFT))&USBHS_OTGSC_BSVIE_MASK)
#define USBHS_OTGSC_BSEIE_MASK                   0x10000000u
#define USBHS_OTGSC_BSEIE_SHIFT                  28
#define USBHS_OTGSC_BSEIE_WIDTH                  1
#define USBHS_OTGSC_BSEIE(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_BSEIE_SHIFT))&USBHS_OTGSC_BSEIE_MASK)
#define USBHS_OTGSC_MSE_MASK                     0x20000000u
#define USBHS_OTGSC_MSE_SHIFT                    29
#define USBHS_OTGSC_MSE_WIDTH                    1
