RT-Thread/rt-thread/bsp/freescale/platform/devices/MK26F18/include/MK26F18.h
#define USBPHY_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR_SHIFT))&USBPHY_USB1_VBUS_DETECT_EN_CHARGER_RESISTOR_MASK)
/* USB1_VBUS_DETECT_SET Bit Fields */
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_THRESH_MASK 0x7u
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_THRESH_SHIFT 0
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_THRESH_WIDTH 3
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_THRESH(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_THRESH_SHIFT))&USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_THRESH_MASK)
#define USBPHY_USB1_VBUS_DETECT_SET_VBUS_OVERRIDE_EN_MASK 0x8u
#define USBPHY_USB1_VBUS_DETECT_SET_VBUS_OVERRIDE_EN_SHIFT 3
#define USBPHY_USB1_VBUS_DETECT_SET_VBUS_OVERRIDE_EN_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_SET_VBUS_OVERRIDE_EN(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_SET_VBUS_OVERRIDE_EN_SHIFT))&USBPHY_USB1_VBUS_DETECT_SET_VBUS_OVERRIDE_EN_MASK)
#define USBPHY_USB1_VBUS_DETECT_SET_SESSEND_OVERRIDE_MASK 0x10u
#define USBPHY_USB1_VBUS_DETECT_SET_SESSEND_OVERRIDE_SHIFT 4
#define USBPHY_USB1_VBUS_DETECT_SET_SESSEND_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_SET_SESSEND_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_SET_SESSEND_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_SET_SESSEND_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_SET_BVALID_OVERRIDE_MASK 0x20u
#define USBPHY_USB1_VBUS_DETECT_SET_BVALID_OVERRIDE_SHIFT 5
#define USBPHY_USB1_VBUS_DETECT_SET_BVALID_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_SET_BVALID_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_SET_BVALID_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_SET_BVALID_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_SET_AVALID_OVERRIDE_MASK 0x40u
#define USBPHY_USB1_VBUS_DETECT_SET_AVALID_OVERRIDE_SHIFT 6
#define USBPHY_USB1_VBUS_DETECT_SET_AVALID_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_SET_AVALID_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_SET_AVALID_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_SET_AVALID_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_OVERRIDE_MASK 0x80u
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_OVERRIDE_SHIFT 7
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_SEL_MASK 0x100u
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_SEL_SHIFT 8
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_SEL_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_SEL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_SEL_SHIFT))&USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_SEL_MASK)
#define USBPHY_USB1_VBUS_DETECT_SET_VBUS_SOURCE_SEL_MASK 0x600u
#define USBPHY_USB1_VBUS_DETECT_SET_VBUS_SOURCE_SEL_SHIFT 9
#define USBPHY_USB1_VBUS_DETECT_SET_VBUS_SOURCE_SEL_WIDTH 2
#define USBPHY_USB1_VBUS_DETECT_SET_VBUS_SOURCE_SEL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_SET_VBUS_SOURCE_SEL_SHIFT))&USBPHY_USB1_VBUS_DETECT_SET_VBUS_SOURCE_SEL_MASK)
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_TO_SESSVALID_MASK 0x40000u
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_TO_SESSVALID_SHIFT 18
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_TO_SESSVALID_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_TO_SESSVALID(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_TO_SESSVALID_SHIFT))&USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_TO_SESSVALID_MASK)
#define USBPHY_USB1_VBUS_DETECT_SET_PWRUP_CMPS_MASK 0x100000u
#define USBPHY_USB1_VBUS_DETECT_SET_PWRUP_CMPS_SHIFT 20
#define USBPHY_USB1_VBUS_DETECT_SET_PWRUP_CMPS_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_SET_PWRUP_CMPS(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_SET_PWRUP_CMPS_SHIFT))&USBPHY_USB1_VBUS_DETECT_SET_PWRUP_CMPS_MASK)
#define USBPHY_USB1_VBUS_DETECT_SET_DISCHARGE_VBUS_MASK 0x4000000u
#define USBPHY_USB1_VBUS_DETECT_SET_DISCHARGE_VBUS_SHIFT 26
#define USBPHY_USB1_VBUS_DETECT_SET_DISCHARGE_VBUS_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_SET_DISCHARGE_VBUS(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_SET_DISCHARGE_VBUS_SHIFT))&USBPHY_USB1_VBUS_DETECT_SET_DISCHARGE_VBUS_MASK)
#define USBPHY_USB1_VBUS_DETECT_SET_EN_CHARGER_RESISTOR_MASK 0x80000000u
#define USBPHY_USB1_VBUS_DETECT_SET_EN_CHARGER_RESISTOR_SHIFT 31
#define USBPHY_USB1_VBUS_DETECT_SET_EN_CHARGER_RESISTOR_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_SET_EN_CHARGER_RESISTOR(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_SET_EN_CHARGER_RESISTOR_SHIFT))&USBPHY_USB1_VBUS_DETECT_SET_EN_CHARGER_RESISTOR_MASK)
/* USB1_VBUS_DETECT_CLR Bit Fields */
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_THRESH_MASK 0x7u
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_THRESH_SHIFT 0
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_THRESH_WIDTH 3
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_THRESH(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_THRESH_SHIFT))&USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_THRESH_MASK)
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUS_OVERRIDE_EN_MASK 0x8u
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUS_OVERRIDE_EN_SHIFT 3
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUS_OVERRIDE_EN_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUS_OVERRIDE_EN(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_CLR_VBUS_OVERRIDE_EN_SHIFT))&USBPHY_USB1_VBUS_DETECT_CLR_VBUS_OVERRIDE_EN_MASK)
#define USBPHY_USB1_VBUS_DETECT_CLR_SESSEND_OVERRIDE_MASK 0x10u
#define USBPHY_USB1_VBUS_DETECT_CLR_SESSEND_OVERRIDE_SHIFT 4
#define USBPHY_USB1_VBUS_DETECT_CLR_SESSEND_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_CLR_SESSEND_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_CLR_SESSEND_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_CLR_SESSEND_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_CLR_BVALID_OVERRIDE_MASK 0x20u
#define USBPHY_USB1_VBUS_DETECT_CLR_BVALID_OVERRIDE_SHIFT 5
#define USBPHY_USB1_VBUS_DETECT_CLR_BVALID_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_CLR_BVALID_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_CLR_BVALID_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_CLR_BVALID_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_CLR_AVALID_OVERRIDE_MASK 0x40u
#define USBPHY_USB1_VBUS_DETECT_CLR_AVALID_OVERRIDE_SHIFT 6
#define USBPHY_USB1_VBUS_DETECT_CLR_AVALID_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_CLR_AVALID_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_CLR_AVALID_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_CLR_AVALID_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_OVERRIDE_MASK 0x80u
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_OVERRIDE_SHIFT 7
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_SEL_MASK 0x100u
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_SEL_SHIFT 8
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_SEL_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_SEL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_SEL_SHIFT))&USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_SEL_MASK)
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUS_SOURCE_SEL_MASK 0x600u
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUS_SOURCE_SEL_SHIFT 9
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUS_SOURCE_SEL_WIDTH 2
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUS_SOURCE_SEL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_CLR_VBUS_SOURCE_SEL_SHIFT))&USBPHY_USB1_VBUS_DETECT_CLR_VBUS_SOURCE_SEL_MASK)
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_TO_SESSVALID_MASK 0x40000u
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_TO_SESSVALID_SHIFT 18
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_TO_SESSVALID_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_TO_SESSVALID(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_TO_SESSVALID_SHIFT))&USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_TO_SESSVALID_MASK)
#define USBPHY_USB1_VBUS_DETECT_CLR_PWRUP_CMPS_MASK 0x100000u
#define USBPHY_USB1_VBUS_DETECT_CLR_PWRUP_CMPS_SHIFT 20
#define USBPHY_USB1_VBUS_DETECT_CLR_PWRUP_CMPS_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_CLR_PWRUP_CMPS(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_CLR_PWRUP_CMPS_SHIFT))&USBPHY_USB1_VBUS_DETECT_CLR_PWRUP_CMPS_MASK)
#define USBPHY_USB1_VBUS_DETECT_CLR_DISCHARGE_VBUS_MASK 0x4000000u
#define USBPHY_USB1_VBUS_DETECT_CLR_DISCHARGE_VBUS_SHIFT 26
#define USBPHY_USB1_VBUS_DETECT_CLR_DISCHARGE_VBUS_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_CLR_DISCHARGE_VBUS(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_CLR_DISCHARGE_VBUS_SHIFT))&USBPHY_USB1_VBUS_DETECT_CLR_DISCHARGE_VBUS_MASK)
#define USBPHY_USB1_VBUS_DETECT_CLR_EN_CHARGER_RESISTOR_MASK 0x80000000u
#define USBPHY_USB1_VBUS_DETECT_CLR_EN_CHARGER_RESISTOR_SHIFT 31
#define USBPHY_USB1_VBUS_DETECT_CLR_EN_CHARGER_RESISTOR_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_CLR_EN_CHARGER_RESISTOR(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_CLR_EN_CHARGER_RESISTOR_SHIFT))&USBPHY_USB1_VBUS_DETECT_CLR_EN_CHARGER_RESISTOR_MASK)
/* USB1_VBUS_DETECT_TOG Bit Fields */
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_THRESH_MASK 0x7u
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_THRESH_SHIFT 0
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_THRESH_WIDTH 3
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_THRESH(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_THRESH_SHIFT))&USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_THRESH_MASK)
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUS_OVERRIDE_EN_MASK 0x8u
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUS_OVERRIDE_EN_SHIFT 3
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUS_OVERRIDE_EN_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUS_OVERRIDE_EN(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_TOG_VBUS_OVERRIDE_EN_SHIFT))&USBPHY_USB1_VBUS_DETECT_TOG_VBUS_OVERRIDE_EN_MASK)
#define USBPHY_USB1_VBUS_DETECT_TOG_SESSEND_OVERRIDE_MASK 0x10u
#define USBPHY_USB1_VBUS_DETECT_TOG_SESSEND_OVERRIDE_SHIFT 4
#define USBPHY_USB1_VBUS_DETECT_TOG_SESSEND_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_TOG_SESSEND_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_TOG_SESSEND_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_TOG_SESSEND_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_TOG_BVALID_OVERRIDE_MASK 0x20u
#define USBPHY_USB1_VBUS_DETECT_TOG_BVALID_OVERRIDE_SHIFT 5
#define USBPHY_USB1_VBUS_DETECT_TOG_BVALID_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_TOG_BVALID_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_TOG_BVALID_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_TOG_BVALID_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_TOG_AVALID_OVERRIDE_MASK 0x40u
#define USBPHY_USB1_VBUS_DETECT_TOG_AVALID_OVERRIDE_SHIFT 6
#define USBPHY_USB1_VBUS_DETECT_TOG_AVALID_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_TOG_AVALID_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_TOG_AVALID_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_TOG_AVALID_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_OVERRIDE_MASK 0x80u
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_OVERRIDE_SHIFT 7
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_OVERRIDE_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_OVERRIDE(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_OVERRIDE_SHIFT))&USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_OVERRIDE_MASK)
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_SEL_MASK 0x100u
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_SEL_SHIFT 8
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_SEL_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_SEL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_SEL_SHIFT))&USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_SEL_MASK)
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUS_SOURCE_SEL_MASK 0x600u
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUS_SOURCE_SEL_SHIFT 9
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUS_SOURCE_SEL_WIDTH 2
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUS_SOURCE_SEL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_TOG_VBUS_SOURCE_SEL_SHIFT))&USBPHY_USB1_VBUS_DETECT_TOG_VBUS_SOURCE_SEL_MASK)
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_TO_SESSVALID_MASK 0x40000u
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_TO_SESSVALID_SHIFT 18
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_TO_SESSVALID_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_TO_SESSVALID(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_TO_SESSVALID_SHIFT))&USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_TO_SESSVALID_MASK)
#define USBPHY_USB1_VBUS_DETECT_TOG_PWRUP_CMPS_MASK 0x100000u
#define USBPHY_USB1_VBUS_DETECT_TOG_PWRUP_CMPS_SHIFT 20
#define USBPHY_USB1_VBUS_DETECT_TOG_PWRUP_CMPS_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_TOG_PWRUP_CMPS(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_TOG_PWRUP_CMPS_SHIFT))&USBPHY_USB1_VBUS_DETECT_TOG_PWRUP_CMPS_MASK)
#define USBPHY_USB1_VBUS_DETECT_TOG_DISCHARGE_VBUS_MASK 0x4000000u
#define USBPHY_USB1_VBUS_DETECT_TOG_DISCHARGE_VBUS_SHIFT 26
#define USBPHY_USB1_VBUS_DETECT_TOG_DISCHARGE_VBUS_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_TOG_DISCHARGE_VBUS(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_TOG_DISCHARGE_VBUS_SHIFT))&USBPHY_USB1_VBUS_DETECT_TOG_DISCHARGE_VBUS_MASK)
#define USBPHY_USB1_VBUS_DETECT_TOG_EN_CHARGER_RESISTOR_MASK 0x80000000u
#define USBPHY_USB1_VBUS_DETECT_TOG_EN_CHARGER_RESISTOR_SHIFT 31
#define USBPHY_USB1_VBUS_DETECT_TOG_EN_CHARGER_RESISTOR_WIDTH 1
#define USBPHY_USB1_VBUS_DETECT_TOG_EN_CHARGER_RESISTOR(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_TOG_EN_CHARGER_RESISTOR_SHIFT))&USBPHY_USB1_VBUS_DETECT_TOG_EN_CHARGER_RESISTOR_MASK)
/* USB1_VBUS_DET_STAT Bit Fields */
#define USBPHY_USB1_VBUS_DET_STAT_SESSEND_MASK   0x1u
#define USBPHY_USB1_VBUS_DET_STAT_SESSEND_SHIFT  0
#define USBPHY_USB1_VBUS_DET_STAT_SESSEND_WIDTH  1
#define USBPHY_USB1_VBUS_DET_STAT_SESSEND(x)     (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DET_STAT_SESSEND_SHIFT))&USBPHY_USB1_VBUS_DET_STAT_SESSEND_MASK)
#define USBPHY_USB1_VBUS_DET_STAT_BVALID_MASK    0x2u
#define USBPHY_USB1_VBUS_DET_STAT_BVALID_SHIFT   1
#define USBPHY_USB1_VBUS_DET_STAT_BVALID_WIDTH   1
#define USBPHY_USB1_VBUS_DET_STAT_BVALID(x)      (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DET_STAT_BVALID_SHIFT))&USBPHY_USB1_VBUS_DET_STAT_BVALID_MASK)
#define USBPHY_USB1_VBUS_DET_STAT_AVALID_MASK    0x4u
#define USBPHY_USB1_VBUS_DET_STAT_AVALID_SHIFT   2
#define USBPHY_USB1_VBUS_DET_STAT_AVALID_WIDTH   1
#define USBPHY_USB1_VBUS_DET_STAT_AVALID(x)      (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DET_STAT_AVALID_SHIFT))&USBPHY_USB1_VBUS_DET_STAT_AVALID_MASK)
#define USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_MASK 0x8u
#define USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_SHIFT 3
#define USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_WIDTH 1
#define USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID(x)  (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_SHIFT))&USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_MASK)
#define USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_3V_MASK 0x10u
#define USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_3V_SHIFT 4
#define USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_3V_WIDTH 1
#define USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_3V(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_3V_SHIFT))&USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_3V_MASK)
/* USB1_CHRG_DET_STAT Bit Fields */
#define USBPHY_USB1_CHRG_DET_STAT_PLUG_CONTACT_MASK 0x1u
#define USBPHY_USB1_CHRG_DET_STAT_PLUG_CONTACT_SHIFT 0
#define USBPHY_USB1_CHRG_DET_STAT_PLUG_CONTACT_WIDTH 1
#define USBPHY_USB1_CHRG_DET_STAT_PLUG_CONTACT(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_CHRG_DET_STAT_PLUG_CONTACT_SHIFT))&USBPHY_USB1_CHRG_DET_STAT_PLUG_CONTACT_MASK)
#define USBPHY_USB1_CHRG_DET_STAT_CHRG_DETECTED_MASK 0x2u
#define USBPHY_USB1_CHRG_DET_STAT_CHRG_DETECTED_SHIFT 1
#define USBPHY_USB1_CHRG_DET_STAT_CHRG_DETECTED_WIDTH 1
#define USBPHY_USB1_CHRG_DET_STAT_CHRG_DETECTED(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_CHRG_DET_STAT_CHRG_DETECTED_SHIFT))&USBPHY_USB1_CHRG_DET_STAT_CHRG_DETECTED_MASK)
#define USBPHY_USB1_CHRG_DET_STAT_DM_STATE_MASK  0x4u
#define USBPHY_USB1_CHRG_DET_STAT_DM_STATE_SHIFT 2
#define USBPHY_USB1_CHRG_DET_STAT_DM_STATE_WIDTH 1
#define USBPHY_USB1_CHRG_DET_STAT_DM_STATE(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_CHRG_DET_STAT_DM_STATE_SHIFT))&USBPHY_USB1_CHRG_DET_STAT_DM_STATE_MASK)
#define USBPHY_USB1_CHRG_DET_STAT_DP_STATE_MASK  0x8u
#define USBPHY_USB1_CHRG_DET_STAT_DP_STATE_SHIFT 3
#define USBPHY_USB1_CHRG_DET_STAT_DP_STATE_WIDTH 1
#define USBPHY_USB1_CHRG_DET_STAT_DP_STATE(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_CHRG_DET_STAT_DP_STATE_SHIFT))&USBPHY_USB1_CHRG_DET_STAT_DP_STATE_MASK)
#define USBPHY_USB1_CHRG_DET_STAT_SECDET_DCP_MASK 0x10u
#define USBPHY_USB1_CHRG_DET_STAT_SECDET_DCP_SHIFT 4
#define USBPHY_USB1_CHRG_DET_STAT_SECDET_DCP_WIDTH 1
#define USBPHY_USB1_CHRG_DET_STAT_SECDET_DCP(x)  (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_CHRG_DET_STAT_SECDET_DCP_SHIFT))&USBPHY_USB1_CHRG_DET_STAT_SECDET_DCP_MASK)
/* ANACTRL Bit Fields */
#define USBPHY_ANACTRL_TESTCLK_SEL_MASK          0x1u
#define USBPHY_ANACTRL_TESTCLK_SEL_SHIFT         0
#define USBPHY_ANACTRL_TESTCLK_SEL_WIDTH         1
#define USBPHY_ANACTRL_TESTCLK_SEL(x)            (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_TESTCLK_SEL_SHIFT))&USBPHY_ANACTRL_TESTCLK_SEL_MASK)
#define USBPHY_ANACTRL_PFD_CLKGATE_MASK          0x2u
#define USBPHY_ANACTRL_PFD_CLKGATE_SHIFT         1
#define USBPHY_ANACTRL_PFD_CLKGATE_WIDTH         1
#define USBPHY_ANACTRL_PFD_CLKGATE(x)            (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_PFD_CLKGATE_SHIFT))&USBPHY_ANACTRL_PFD_CLKGATE_MASK)
#define USBPHY_ANACTRL_PFD_CLK_SEL_MASK          0xCu
#define USBPHY_ANACTRL_PFD_CLK_SEL_SHIFT         2
#define USBPHY_ANACTRL_PFD_CLK_SEL_WIDTH         2
#define USBPHY_ANACTRL_PFD_CLK_SEL(x)            (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_PFD_CLK_SEL_SHIFT))&USBPHY_ANACTRL_PFD_CLK_SEL_MASK)
#define USBPHY_ANACTRL_PFD_FRAC_MASK             0x3F0u
#define USBPHY_ANACTRL_PFD_FRAC_SHIFT            4
#define USBPHY_ANACTRL_PFD_FRAC_WIDTH            6
#define USBPHY_ANACTRL_PFD_FRAC(x)               (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_PFD_FRAC_SHIFT))&USBPHY_ANACTRL_PFD_FRAC_MASK)
#define USBPHY_ANACTRL_DEV_PULLDOWN_MASK         0x400u
#define USBPHY_ANACTRL_DEV_PULLDOWN_SHIFT        10
#define USBPHY_ANACTRL_DEV_PULLDOWN_WIDTH        1
#define USBPHY_ANACTRL_DEV_PULLDOWN(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_DEV_PULLDOWN_SHIFT))&USBPHY_ANACTRL_DEV_PULLDOWN_MASK)
#define USBPHY_ANACTRL_EMPH_PULSE_CTRL_MASK      0x1800u
#define USBPHY_ANACTRL_EMPH_PULSE_CTRL_SHIFT     11
#define USBPHY_ANACTRL_EMPH_PULSE_CTRL_WIDTH     2
#define USBPHY_ANACTRL_EMPH_PULSE_CTRL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_EMPH_PULSE_CTRL_SHIFT))&USBPHY_ANACTRL_EMPH_PULSE_CTRL_MASK)
#define USBPHY_ANACTRL_EMPH_EN_MASK              0x2000u
#define USBPHY_ANACTRL_EMPH_EN_SHIFT             13
#define USBPHY_ANACTRL_EMPH_EN_WIDTH             1
#define USBPHY_ANACTRL_EMPH_EN(x)                (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_EMPH_EN_SHIFT))&USBPHY_ANACTRL_EMPH_EN_MASK)
#define USBPHY_ANACTRL_EMPH_CUR_CTRL_MASK        0xC000u
#define USBPHY_ANACTRL_EMPH_CUR_CTRL_SHIFT       14
#define USBPHY_ANACTRL_EMPH_CUR_CTRL_WIDTH       2
#define USBPHY_ANACTRL_EMPH_CUR_CTRL(x)          (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_EMPH_CUR_CTRL_SHIFT))&USBPHY_ANACTRL_EMPH_CUR_CTRL_MASK)
#define USBPHY_ANACTRL_PFD_STABLE_MASK           0x80000000u
#define USBPHY_ANACTRL_PFD_STABLE_SHIFT          31
#define USBPHY_ANACTRL_PFD_STABLE_WIDTH          1
#define USBPHY_ANACTRL_PFD_STABLE(x)             (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_PFD_STABLE_SHIFT))&USBPHY_ANACTRL_PFD_STABLE_MASK)
/* ANACTRL_SET Bit Fields */
#define USBPHY_ANACTRL_SET_TESTCLK_SEL_MASK      0x1u
#define USBPHY_ANACTRL_SET_TESTCLK_SEL_SHIFT     0
#define USBPHY_ANACTRL_SET_TESTCLK_SEL_WIDTH     1
#define USBPHY_ANACTRL_SET_TESTCLK_SEL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_SET_TESTCLK_SEL_SHIFT))&USBPHY_ANACTRL_SET_TESTCLK_SEL_MASK)
#define USBPHY_ANACTRL_SET_PFD_CLKGATE_MASK      0x2u
#define USBPHY_ANACTRL_SET_PFD_CLKGATE_SHIFT     1
#define USBPHY_ANACTRL_SET_PFD_CLKGATE_WIDTH     1
#define USBPHY_ANACTRL_SET_PFD_CLKGATE(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_SET_PFD_CLKGATE_SHIFT))&USBPHY_ANACTRL_SET_PFD_CLKGATE_MASK)
#define USBPHY_ANACTRL_SET_PFD_CLK_SEL_MASK      0xCu
#define USBPHY_ANACTRL_SET_PFD_CLK_SEL_SHIFT     2
#define USBPHY_ANACTRL_SET_PFD_CLK_SEL_WIDTH     2
#define USBPHY_ANACTRL_SET_PFD_CLK_SEL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_SET_PFD_CLK_SEL_SHIFT))&USBPHY_ANACTRL_SET_PFD_CLK_SEL_MASK)
#define USBPHY_ANACTRL_SET_PFD_FRAC_MASK         0x3F0u
#define USBPHY_ANACTRL_SET_PFD_FRAC_SHIFT        4
#define USBPHY_ANACTRL_SET_PFD_FRAC_WIDTH        6
#define USBPHY_ANACTRL_SET_PFD_FRAC(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_SET_PFD_FRAC_SHIFT))&USBPHY_ANACTRL_SET_PFD_FRAC_MASK)
#define USBPHY_ANACTRL_SET_DEV_PULLDOWN_MASK     0x400u
#define USBPHY_ANACTRL_SET_DEV_PULLDOWN_SHIFT    10
#define USBPHY_ANACTRL_SET_DEV_PULLDOWN_WIDTH    1
#define USBPHY_ANACTRL_SET_DEV_PULLDOWN(x)       (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_SET_DEV_PULLDOWN_SHIFT))&USBPHY_ANACTRL_SET_DEV_PULLDOWN_MASK)
#define USBPHY_ANACTRL_SET_EMPH_PULSE_CTRL_MASK  0x1800u
#define USBPHY_ANACTRL_SET_EMPH_PULSE_CTRL_SHIFT 11
#define USBPHY_ANACTRL_SET_EMPH_PULSE_CTRL_WIDTH 2
#define USBPHY_ANACTRL_SET_EMPH_PULSE_CTRL(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_SET_EMPH_PULSE_CTRL_SHIFT))&USBPHY_ANACTRL_SET_EMPH_PULSE_CTRL_MASK)
#define USBPHY_ANACTRL_SET_EMPH_EN_MASK          0x2000u
#define USBPHY_ANACTRL_SET_EMPH_EN_SHIFT         13
#define USBPHY_ANACTRL_SET_EMPH_EN_WIDTH         1
#define USBPHY_ANACTRL_SET_EMPH_EN(x)            (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_SET_EMPH_EN_SHIFT))&USBPHY_ANACTRL_SET_EMPH_EN_MASK)
#define USBPHY_ANACTRL_SET_EMPH_CUR_CTRL_MASK    0xC000u
#define USBPHY_ANACTRL_SET_EMPH_CUR_CTRL_SHIFT   14
#define USBPHY_ANACTRL_SET_EMPH_CUR_CTRL_WIDTH   2
#define USBPHY_ANACTRL_SET_EMPH_CUR_CTRL(x)      (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_SET_EMPH_CUR_CTRL_SHIFT))&USBPHY_ANACTRL_SET_EMPH_CUR_CTRL_MASK)
#define USBPHY_ANACTRL_SET_PFD_STABLE_MASK       0x80000000u
#define USBPHY_ANACTRL_SET_PFD_STABLE_SHIFT      31
#define USBPHY_ANACTRL_SET_PFD_STABLE_WIDTH      1
#define USBPHY_ANACTRL_SET_PFD_STABLE(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_SET_PFD_STABLE_SHIFT))&USBPHY_ANACTRL_SET_PFD_STABLE_MASK)
/* ANACTRL_CLR Bit Fields */
#define USBPHY_ANACTRL_CLR_TESTCLK_SEL_MASK      0x1u
#define USBPHY_ANACTRL_CLR_TESTCLK_SEL_SHIFT     0
#define USBPHY_ANACTRL_CLR_TESTCLK_SEL_WIDTH     1
#define USBPHY_ANACTRL_CLR_TESTCLK_SEL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_CLR_TESTCLK_SEL_SHIFT))&USBPHY_ANACTRL_CLR_TESTCLK_SEL_MASK)
#define USBPHY_ANACTRL_CLR_PFD_CLKGATE_MASK      0x2u
#define USBPHY_ANACTRL_CLR_PFD_CLKGATE_SHIFT     1
#define USBPHY_ANACTRL_CLR_PFD_CLKGATE_WIDTH     1
#define USBPHY_ANACTRL_CLR_PFD_CLKGATE(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_CLR_PFD_CLKGATE_SHIFT))&USBPHY_ANACTRL_CLR_PFD_CLKGATE_MASK)
#define USBPHY_ANACTRL_CLR_PFD_CLK_SEL_MASK      0xCu
#define USBPHY_ANACTRL_CLR_PFD_CLK_SEL_SHIFT     2
#define USBPHY_ANACTRL_CLR_PFD_CLK_SEL_WIDTH     2
#define USBPHY_ANACTRL_CLR_PFD_CLK_SEL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_CLR_PFD_CLK_SEL_SHIFT))&USBPHY_ANACTRL_CLR_PFD_CLK_SEL_MASK)
#define USBPHY_ANACTRL_CLR_PFD_FRAC_MASK         0x3F0u
#define USBPHY_ANACTRL_CLR_PFD_FRAC_SHIFT        4
#define USBPHY_ANACTRL_CLR_PFD_FRAC_WIDTH        6
